Documentation enhancement
